; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob14) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 distributor0)
	(clear crate0)
	(at pallet2 distributor1)
	(clear crate4)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 306)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 238)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 15)
	(at crate1 depot0)
	(on crate1 pallet0)
	(= (weight crate1) 86)
	(at crate2 distributor1)
	(on crate2 pallet2)
	(= (weight crate2) 71)
	(at crate3 distributor1)
	(on crate3 crate2)
	(= (weight crate3) 52)
	(at crate4 distributor1)
	(on crate4 crate3)
	(= (weight crate4) 6)
	(at crate5 depot0)
	(on crate5 crate1)
	(= (weight crate5) 17)
	(at crate6 depot0)
	(on crate6 crate5)
	(= (weight crate6) 31)
	(at crate7 depot0)
	(on crate7 crate6)
	(= (weight crate7) 71)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate5)
		(on crate1 crate2)
		(on crate2 crate4)
		(on crate3 crate6)
		(on crate4 crate3)
		(on crate5 pallet0)
		(on crate6 pallet2)
		(on crate7 pallet1)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 8
2. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 15
   goals met: 1 of 8
3. (lift hoist0 crate7 crate6 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate6)
   added: (lifting hoist0 crate7) (clear crate6)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 8
4. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 2 to 12
   goals met: 1 of 8
5. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   changed: (current_load truck0) from 15 to 86
   goals met: 1 of 8
6. (lift hoist0 crate6 crate5 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate5)
   added: (lifting hoist0 crate6) (clear crate5)
   changed: (fuel-cost) from 12 to 13
   goals met: 1 of 8
7. (load hoist0 crate6 truck0 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck0) (available hoist0)
   changed: (current_load truck0) from 86 to 117
   goals met: 1 of 8
8. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck0) from 117 to 102
   goals met: 1 of 8
9. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 13 to 23
   goals met: 1 of 8
10. (unload hoist2 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck0) from 102 to 71
   goals met: 1 of 8
11. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 23 to 33
   goals met: 1 of 8
12. (unload hoist1 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 71 to 0
   goals met: 1 of 8
13. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 33 to 43
   goals met: 1 of 8
14. (drop hoist1 crate7 pallet1 distributor0)
   deleted: (lifting hoist1 crate7) (clear pallet1)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 pallet1)
   goals met: 2 of 8
15. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 15
   goals met: 2 of 8
16. (lift hoist0 crate5 crate1 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate1)
   added: (lifting hoist0 crate5) (clear crate1)
   changed: (fuel-cost) from 43 to 44
   goals met: 2 of 8
17. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   changed: (current_load truck0) from 15 to 32
   goals met: 2 of 8
18. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   changed: (fuel-cost) from 44 to 45
   goals met: 2 of 8
19. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   changed: (current_load truck0) from 32 to 118
   goals met: 2 of 8
20. (unload hoist0 crate5 truck0 depot0)
   deleted: (in crate5 truck0) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck0) from 118 to 101
   goals met: 2 of 8
21. (drop hoist0 crate5 pallet0 depot0)
   deleted: (lifting hoist0 crate5) (clear pallet0)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 pallet0)
   goals met: 3 of 8
22. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck0) from 101 to 86
   goals met: 3 of 8
23. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 45 to 55
   goals met: 3 of 8
24. (drop hoist0 crate0 crate5 depot0)
   deleted: (lifting hoist0 crate0) (clear crate5)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate5)
   goals met: 4 of 8
25. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 86 to 117
   goals met: 4 of 8
26. (lift hoist2 crate4 crate3 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate3)
   added: (lifting hoist2 crate4) (clear crate3)
   changed: (fuel-cost) from 55 to 56
   goals met: 3 of 8
27. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 117 to 123
   goals met: 3 of 8
28. (lift hoist2 crate3 crate2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 crate2)
   added: (lifting hoist2 crate3) (clear crate2)
   changed: (fuel-cost) from 56 to 57
   goals met: 3 of 8
29. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 123 to 175
   goals met: 3 of 8
30. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 175 to 89
   goals met: 3 of 8
31. (drop hoist2 crate1 crate2 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate2)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate2)
   goals met: 4 of 8
32. (unload hoist2 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck0) from 89 to 58
   goals met: 4 of 8
33. (drop hoist2 crate6 crate1 distributor1)
   deleted: (lifting hoist2 crate6) (clear crate1)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 crate1)
   goals met: 4 of 8
34. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 58 to 6
   goals met: 4 of 8
35. (drop hoist2 crate3 crate6 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate6)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate6)
   goals met: 5 of 8
36. (lift hoist2 crate3 crate6 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 crate6)
   added: (lifting hoist2 crate3) (clear crate6)
   changed: (fuel-cost) from 57 to 58
   goals met: 4 of 8
37. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 6 to 58
   goals met: 4 of 8
38. (lift hoist2 crate6 crate1 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate1)
   added: (lifting hoist2 crate6) (clear crate1)
   changed: (fuel-cost) from 58 to 59
   goals met: 4 of 8
39. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 58 to 89
   goals met: 4 of 8
40. (lift hoist2 crate1 crate2 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist2) (on crate1 crate2)
   added: (lifting hoist2 crate1) (clear crate2)
   changed: (fuel-cost) from 59 to 60
   goals met: 3 of 8
41. (load hoist2 crate1 truck0 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck0) (available hoist2)
   changed: (current_load truck0) from 89 to 175
   goals met: 3 of 8
42. (lift hoist2 crate2 pallet2 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   changed: (fuel-cost) from 60 to 61
   goals met: 3 of 8
43. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 175 to 246
   goals met: 3 of 8
44. (unload hoist2 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck0) from 246 to 215
   goals met: 3 of 8
45. (drop hoist2 crate6 pallet2 distributor1)
   deleted: (lifting hoist2 crate6) (clear pallet2)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 pallet2)
   goals met: 4 of 8
46. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 215 to 163
   goals met: 4 of 8
47. (drop hoist2 crate3 crate6 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate6)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate6)
   goals met: 5 of 8
48. (unload hoist2 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   changed: (current_load truck0) from 163 to 92
   goals met: 5 of 8
49. (drop hoist2 crate2 crate3 distributor1)
   deleted: (lifting hoist2 crate2) (clear crate3)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 crate3)
   goals met: 5 of 8
50. (lift hoist2 crate2 crate3 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate3)
   added: (lifting hoist2 crate2) (clear crate3)
   changed: (fuel-cost) from 61 to 62
   goals met: 5 of 8
51. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 92 to 163
   goals met: 5 of 8
52. (unload hoist2 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 163 to 157
   goals met: 5 of 8
53. (drop hoist2 crate4 crate3 distributor1)
   deleted: (lifting hoist2 crate4) (clear crate3)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 crate3)
   goals met: 6 of 8
54. (unload hoist2 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   changed: (current_load truck0) from 157 to 86
   goals met: 6 of 8
55. (drop hoist2 crate2 crate4 distributor1)
   deleted: (lifting hoist2 crate2) (clear crate4)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 crate4)
   goals met: 7 of 8
56. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 86 to 0
   goals met: 7 of 8
57. (drop hoist2 crate1 crate2 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate2)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate2)
   goals met: 8 of 8
